In [98]:
people={
    'first':['lokesh','meena','nirosha'],
    'last':['reddy','reddy','reddy'],
    'mail':['lokeshreddy@gmail.com','meenareddy@gmail.com','niroshareddy@gmail.com']
}

In [99]:
people

{'first': ['lokesh', 'meena', 'nirosha'],
 'last': ['reddy', 'reddy', 'reddy'],
 'mail': ['lokeshreddy@gmail.com',
  'meenareddy@gmail.com',
  'niroshareddy@gmail.com']}

In [100]:
import pandas as pd

In [101]:
df=pd.DataFrame(people)

In [102]:
df

     first   last                    mail
0   lokesh  reddy   lokeshreddy@gmail.com
1    meena  reddy    meenareddy@gmail.com
2  nirosha  reddy  niroshareddy@gmail.com

In [103]:
df['last']

0    reddy
1    reddy
2    reddy
Name: last, dtype: object

In [104]:
df[['first','mail']]

     first                    mail
0   lokesh   lokeshreddy@gmail.com
1    meena    meenareddy@gmail.com
2  nirosha  niroshareddy@gmail.com

In [105]:
df.columns

Index(['first', 'last', 'mail'], dtype='object')

In [106]:
type(df)

pandas.core.frame.DataFrame

In [107]:
df.iloc[1]

first                   meena
last                    reddy
mail     meenareddy@gmail.com
Name: 1, dtype: object

In [108]:
df.iloc[[0,2]]

     first   last                    mail
0   lokesh  reddy   lokeshreddy@gmail.com
2  nirosha  reddy  niroshareddy@gmail.com

In [109]:
df.iloc[[0,2],2]

0     lokeshreddy@gmail.com
2    niroshareddy@gmail.com
Name: mail, dtype: object

In [110]:
df.loc[0]

first                   lokesh
last                     reddy
mail     lokeshreddy@gmail.com
Name: 0, dtype: object

In [111]:
df.loc[[0,2],'mail']

0     lokeshreddy@gmail.com
2    niroshareddy@gmail.com
Name: mail, dtype: object

In [112]:
df.loc[[0,2]]

     first   last                    mail
0   lokesh  reddy   lokeshreddy@gmail.com
2  nirosha  reddy  niroshareddy@gmail.com

In [113]:
df.loc[[0,1],['first','last']]

    first   last
0  lokesh  reddy
1   meena  reddy

In [114]:
df.shape

(3, 3)

In [115]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
first    3 non-null object
last     3 non-null object
mail     3 non-null object
dtypes: object(3)
memory usage: 152.0+ bytes

In [116]:
df

     first   last                    mail
0   lokesh  reddy   lokeshreddy@gmail.com
1    meena  reddy    meenareddy@gmail.com
2  nirosha  reddy  niroshareddy@gmail.com

In [117]:
df['mail']

0     lokeshreddy@gmail.com
1      meenareddy@gmail.com
2    niroshareddy@gmail.com
Name: mail, dtype: object

In [118]:
df.set_index('mail',inplace=True)

In [119]:
df

                          first   last
mail
lokeshreddy@gmail.com    lokesh  reddy
meenareddy@gmail.com      meena  reddy
niroshareddy@gmail.com  nirosha  reddy

In [120]:
df.index

Index(['lokeshreddy@gmail.com', 'meenareddy@gmail.com',
       'niroshareddy@gmail.com'],
      dtype='object', name='mail')

In [121]:
df.loc['lokeshreddy@gmail.com','last']

'reddy'

In [122]:
df.iloc[0]

first    lokesh
last      reddy
Name: lokeshreddy@gmail.com, dtype: object

In [123]:
df.reset_index(inplace=True)

In [124]:
df

                     mail    first   last
0   lokeshreddy@gmail.com   lokesh  reddy
1    meenareddy@gmail.com    meena  reddy
2  niroshareddy@gmail.com  nirosha  reddy

In [125]:
filt = (df['last'] =='reddy')

In [126]:
df[filt]

                     mail    first   last
0   lokeshreddy@gmail.com   lokesh  reddy
1    meenareddy@gmail.com    meena  reddy
2  niroshareddy@gmail.com  nirosha  reddy

In [127]:
df.loc[filt,'mail']

0     lokeshreddy@gmail.com
1      meenareddy@gmail.com
2    niroshareddy@gmail.com
Name: mail, dtype: object

In [128]:
df.loc[0]

mail     lokeshreddy@gmail.com
first                   lokesh
last                     reddy
Name: 0, dtype: object

In [129]:
filt=(df['last'] == 'reddy') | (df['first'] == 'lokesh')

In [130]:
df[filt]

                     mail    first   last
0   lokeshreddy@gmail.com   lokesh  reddy
1    meenareddy@gmail.com    meena  reddy
2  niroshareddy@gmail.com  nirosha  reddy

In [131]:
df.loc[~filt,'mail']

Series([], Name: mail, dtype: object)

In [132]:
df.columns

Index(['mail', 'first', 'last'], dtype='object')

In [133]:
df.columns=['mail','first_name','last_name']

In [134]:
df

                     mail first_name last_name
0   lokeshreddy@gmail.com     lokesh     reddy
1    meenareddy@gmail.com      meena     reddy
2  niroshareddy@gmail.com    nirosha     reddy

In [135]:
df.columns

Index(['mail', 'first_name', 'last_name'], dtype='object')

In [136]:
df.columns=[x.upper() for x in df.columns]

In [137]:
df

                     MAIL FIRST_NAME LAST_NAME
0   lokeshreddy@gmail.com     lokesh     reddy
1    meenareddy@gmail.com      meena     reddy
2  niroshareddy@gmail.com    nirosha     reddy

In [138]:
df.columns=df.columns.str.replace('-','_')
df

                     MAIL FIRST_NAME LAST_NAME
0   lokeshreddy@gmail.com     lokesh     reddy
1    meenareddy@gmail.com      meena     reddy
2  niroshareddy@gmail.com    nirosha     reddy

In [139]:
df.columns=[x.lower() for x in df.columns]
df

                     mail first_name last_name
0   lokeshreddy@gmail.com     lokesh     reddy
1    meenareddy@gmail.com      meena     reddy
2  niroshareddy@gmail.com    nirosha     reddy

In [140]:
df.rename(columns={'first_name':'first','last_name':'last'},inplace=True)
df

                     mail    first   last
0   lokeshreddy@gmail.com   lokesh  reddy
1    meenareddy@gmail.com    meena  reddy
2  niroshareddy@gmail.com  nirosha  reddy

In [141]:
df.iloc[2]=['nirosha@gmail.com','nirosha','chinath']
df

                    mail    first     last
0  lokeshreddy@gmail.com   lokesh    reddy
1   meenareddy@gmail.com    meena    reddy
2      nirosha@gmail.com  nirosha  chinath

In [142]:
df.loc[2,['mail','last']]=['niroshareddy@gmail.com','reddy']
df

                     mail    first   last
0   lokeshreddy@gmail.com   lokesh  reddy
1    meenareddy@gmail.com    meena  reddy
2  niroshareddy@gmail.com  nirosha  reddy

In [143]:
df.at[0,'mail']='lokeshkumarreddy.c@gmail.com'
df

                           mail    first   last
0  lokeshkumarreddy.c@gmail.com   lokesh  reddy
1          meenareddy@gmail.com    meena  reddy
2        niroshareddy@gmail.com  nirosha  reddy

In [144]:
df.set_index('first',inplace=True)
df

                                 mail   last
first
lokesh   lokeshkumarreddy.c@gmail.com  reddy
meena            meenareddy@gmail.com  reddy
nirosha        niroshareddy@gmail.com  reddy

In [145]:
df.reset_index(inplace=True)

In [146]:
df

     first                          mail   last
0   lokesh  lokeshkumarreddy.c@gmail.com  reddy
1    meena          meenareddy@gmail.com  reddy
2  nirosha        niroshareddy@gmail.com  reddy

In [147]:
df['mail'].apply(len)

0    28
1    20
2    22
Name: mail, dtype: int64

In [148]:
def update_email(email):
    return email.upper()

In [149]:
df['mail'].apply(update_email)

0    LOKESHKUMARREDDY.C@GMAIL.COM
1            MEENAREDDY@GMAIL.COM
2          NIROSHAREDDY@GMAIL.COM
Name: mail, dtype: object

In [150]:
df

     first                          mail   last
0   lokesh  lokeshkumarreddy.c@gmail.com  reddy
1    meena          meenareddy@gmail.com  reddy
2  nirosha        niroshareddy@gmail.com  reddy

In [151]:
df['mail']=df['mail'].apply(update_email)

In [152]:
df

     first                          mail   last
0   lokesh  LOKESHKUMARREDDY.C@GMAIL.COM  reddy
1    meena          MEENAREDDY@GMAIL.COM  reddy
2  nirosha        NIROSHAREDDY@GMAIL.COM  reddy

In [153]:
df['mail']=df['mail'].apply(lambda x :x.lower())
df

     first                          mail   last
0   lokesh  lokeshkumarreddy.c@gmail.com  reddy
1    meena          meenareddy@gmail.com  reddy
2  nirosha        niroshareddy@gmail.com  reddy

In [154]:
df.apply(len)

first    3
mail     3
last     3
dtype: int64

In [155]:
df.apply(len,axis='columns')

0    3
1    3
2    3
dtype: int64

In [156]:
df.apply(pd.Series.min)

first                          lokesh
mail     lokeshkumarreddy.c@gmail.com
last                            reddy
dtype: object

In [157]:
df.apply(lambda x:x.min())

first                          lokesh
mail     lokeshkumarreddy.c@gmail.com
last                            reddy
dtype: object

In [158]:
df.applymap(len)

   first  mail  last
0      6    28     5
1      5    20     5
2      7    22     5

In [159]:
df.applymap(str.lower)

     first                          mail   last
0   lokesh  lokeshkumarreddy.c@gmail.com  reddy
1    meena          meenareddy@gmail.com  reddy
2  nirosha        niroshareddy@gmail.com  reddy

In [160]:
df['first']+' '+df['last']

0     lokesh reddy
1      meena reddy
2    nirosha reddy
dtype: object

In [161]:
df

     first                          mail   last
0   lokesh  lokeshkumarreddy.c@gmail.com  reddy
1    meena          meenareddy@gmail.com  reddy
2  nirosha        niroshareddy@gmail.com  reddy

In [162]:
df['full_name']=df['first']+' '+df['last']

In [163]:
df

     first                          mail   last      full_name
0   lokesh  lokeshkumarreddy.c@gmail.com  reddy   lokesh reddy
1    meena          meenareddy@gmail.com  reddy    meena reddy
2  nirosha        niroshareddy@gmail.com  reddy  nirosha reddy

In [164]:
df.drop(columns=['first','last'],inplace=True)

In [165]:
df

                           mail      full_name
0  lokeshkumarreddy.c@gmail.com   lokesh reddy
1          meenareddy@gmail.com    meena reddy
2        niroshareddy@gmail.com  nirosha reddy

In [166]:
df['full_name'].str.split(' ',expand=True)

         0      1
0   lokesh  reddy
1    meena  reddy
2  nirosha  reddy

In [167]:
df[['first','last']]=df['full_name'].str.split(' ',expand=True)

In [168]:
df

                           mail      full_name    first   last
0  lokeshkumarreddy.c@gmail.com   lokesh reddy   lokesh  reddy
1          meenareddy@gmail.com    meena reddy    meena  reddy
2        niroshareddy@gmail.com  nirosha reddy  nirosha  reddy

In [169]:
df.drop(columns='full_name')

                           mail    first   last
0  lokeshkumarreddy.c@gmail.com   lokesh  reddy
1          meenareddy@gmail.com    meena  reddy
2        niroshareddy@gmail.com  nirosha  reddy

In [170]:
df.append({'first':'tony'},ignore_index=True)

                           mail      full_name    first   last
0  lokeshkumarreddy.c@gmail.com   lokesh reddy   lokesh  reddy
1          meenareddy@gmail.com    meena reddy    meena  reddy
2        niroshareddy@gmail.com  nirosha reddy  nirosha  reddy
3                           NaN            NaN     tony    NaN

In [171]:
df.loc[3,'mail']='tony@mail.com'

In [172]:
df

                           mail      full_name    first   last
0  lokeshkumarreddy.c@gmail.com   lokesh reddy   lokesh  reddy
1          meenareddy@gmail.com    meena reddy    meena  reddy
2        niroshareddy@gmail.com  nirosha reddy  nirosha  reddy
3                 tony@mail.com            NaN      NaN    NaN

In [173]:
people={
    'first':['thor','hulk'],
    'last':['chris','rudolf'],
    'mail':['thor@aveng.com','hulk@avenge.com']
}

In [174]:
df2=pd.DataFrame(people)

In [175]:
df2

  first    last             mail
0  thor   chris   thor@aveng.com
1  hulk  rudolf  hulk@avenge.com

In [176]:
df.append(df2,ignore_index=True)

     first      full_name    last                          mail
0   lokesh   lokesh reddy   reddy  lokeshkumarreddy.c@gmail.com
1    meena    meena reddy   reddy          meenareddy@gmail.com
2  nirosha  nirosha reddy   reddy        niroshareddy@gmail.com
3      NaN            NaN     NaN                 tony@mail.com
4     thor            NaN   chris                thor@aveng.com
5     hulk            NaN  rudolf               hulk@avenge.com

In [177]:
df=df.append(df2,ignore_index=True)

In [178]:
df

     first      full_name    last                          mail
0   lokesh   lokesh reddy   reddy  lokeshkumarreddy.c@gmail.com
1    meena    meena reddy   reddy          meenareddy@gmail.com
2  nirosha  nirosha reddy   reddy        niroshareddy@gmail.com
3      NaN            NaN     NaN                 tony@mail.com
4     thor            NaN   chris                thor@aveng.com
5     hulk            NaN  rudolf               hulk@avenge.com

In [179]:
df.drop(index=[3,5],inplace=True)

In [180]:
df

     first      full_name   last                          mail
0   lokesh   lokesh reddy  reddy  lokeshkumarreddy.c@gmail.com
1    meena    meena reddy  reddy          meenareddy@gmail.com
2  nirosha  nirosha reddy  reddy        niroshareddy@gmail.com
4     thor            NaN  chris                thor@aveng.com

In [181]:
filt=df['last']=='reddy'
df.drop(index=df[filt].index)

  first full_name   last            mail
4  thor       NaN  chris  thor@aveng.com

In [182]:
df

     first      full_name   last                          mail
0   lokesh   lokesh reddy  reddy  lokeshkumarreddy.c@gmail.com
1    meena    meena reddy  reddy          meenareddy@gmail.com
2  nirosha  nirosha reddy  reddy        niroshareddy@gmail.com
4     thor            NaN  chris                thor@aveng.com

In [183]:
people={
    'first':['lokesh','meena','nirosha'],
    'last':['reddy','reddy','reddy'],
    'mail':['lokeshreddy@gmail.com','meenareddy@gmail.com','niroshareddy@gmail.com']
}
df3=pd.DataFrame(people)

In [184]:
df3

     first   last                    mail
0   lokesh  reddy   lokeshreddy@gmail.com
1    meena  reddy    meenareddy@gmail.com
2  nirosha  reddy  niroshareddy@gmail.com

In [185]:
df3.sort_values(by='first',ascending=False)

     first   last                    mail
2  nirosha  reddy  niroshareddy@gmail.com
1    meena  reddy    meenareddy@gmail.com
0   lokesh  reddy   lokeshreddy@gmail.com

In [186]:
df3.sort_values(by=['last','first'],ascending=[True,False],inplace=True)

In [187]:
df3

     first   last                    mail
2  nirosha  reddy  niroshareddy@gmail.com
1    meena  reddy    meenareddy@gmail.com
0   lokesh  reddy   lokeshreddy@gmail.com

In [1]:
import pandas as pd
import numpy as np

In [3]:
people={
    'first':['lokesh','meena','nirosha',np.nan,None,'NA'],
    'last':['reddy','reddy','reddy',np.nan,np.nan,'Missing'],
    'mail':['lokeshreddy@gmail.com','meenareddy@gmail.com','niroshareddy@gmail.com',None,np.nan,'Anonymous@gmail.com'
],
    'age':['20','26','22',None,None,'Missing']
}

In [19]:
df=pd.DataFrame(people)

df.replace('NA',np.nan,inplace=True)
df.replace('Missing',np.nan,inplace=True)

In [20]:
df

    age    first   last                    mail
0    20   lokesh  reddy   lokeshreddy@gmail.com
1    26    meena  reddy    meenareddy@gmail.com
2    22  nirosha  reddy  niroshareddy@gmail.com
3  None      NaN    NaN                    None
4  None     None    NaN                     NaN
5   NaN      NaN    NaN     Anonymous@gmail.com

In [21]:
df.dropna()

  age    first   last                    mail
0  20   lokesh  reddy   lokeshreddy@gmail.com
1  26    meena  reddy    meenareddy@gmail.com
2  22  nirosha  reddy  niroshareddy@gmail.com

In [22]:
df.dropna(axis='columns',how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [23]:
df.dropna(axis='index',how='any',subset=['mail'])

   age    first   last                    mail
0   20   lokesh  reddy   lokeshreddy@gmail.com
1   26    meena  reddy    meenareddy@gmail.com
2   22  nirosha  reddy  niroshareddy@gmail.com
5  NaN      NaN    NaN     Anonymous@gmail.com

In [24]:
df.isna()

     age  first   last   mail
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3   True   True   True   True
4   True   True   True   True
5   True   True   True  False

In [27]:
df.fillna('MISSING')

       age    first     last                    mail
0       20   lokesh    reddy   lokeshreddy@gmail.com
1       26    meena    reddy    meenareddy@gmail.com
2       22  nirosha    reddy  niroshareddy@gmail.com
3  MISSING  MISSING  MISSING                 MISSING
4  MISSING  MISSING  MISSING                 MISSING
5  MISSING  MISSING  MISSING     Anonymous@gmail.com

In [28]:
df.fillna(0)

  age    first   last                    mail
0  20   lokesh  reddy   lokeshreddy@gmail.com
1  26    meena  reddy    meenareddy@gmail.com
2  22  nirosha  reddy  niroshareddy@gmail.com
3   0        0      0                       0
4   0        0      0                       0
5   0        0      0     Anonymous@gmail.com

In [29]:
df.isna()

     age  first   last   mail
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3   True   True   True   True
4   True   True   True   True
5   True   True   True  False

In [31]:
df.dtypes

age      object
first    object
last     object
mail     object
dtype: object

In [32]:
df['age']=df['age'].astypepe(float)

In [33]:
df['age'].median()

22.0

In [34]:
df['age'].mean()

22.666666666666668